
{
    "version": 7,
    "dayOne": [
        {
            "id": "check-in",
            "title": "Registrations and Light Snacks 🥯☕📝",
            "description": null,
            "startTime": 1758857400,
            "durationMinutes": 45,
            "type": "others",
            "subtype": "Check-In/Breakfast",
            "speakerId": null
        },
        {
            "id": "organisers-kick-off",
            "title": "Organisers - Welcome Talk",
            "description": null,
            "startTime": 1758860100,
            "durationMinutes": 10,
            "type": "others",
            "subtype": "Kick-off",
            "speakerId": null
        },
        {
            "id": "paul-hudson",
            "title": "Opening Keynote",
            "description": "Paul Hudson is the force behind Hacking with Swift, the go-to resource for millions of iOS developers.\n\nHe has a knack for turning tricky Swift concepts into easy, practical lessons — and if you’ve ever searched for a coding fix, chances are Paul already saved your day.\n\nHe’s also a conference favorite around the world, known for bringing both depth and fun to his talks. More than just a teacher, Paul’s passion for sharing knowledge has made him a mentor and inspiration for developers everywhere.\n\nAt Swift Bharat, you’ll get to see why the Swift community holds him in such high regard.",
            "startTime": 1758860700,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "paul-hudson"
        },
        {
            "id": "kamal-kumar",
            "title": "The 1px War",
            "description": "Kamal Kumar Lakshmanan is the co-founder and lead engineer behind Box Box, a premier Formula 1 fan app featuring real-time stats, widgets, and community tools.\n\nHe also launched Go Club, a habit-tracking / wellness app (notably featured as “App of the Day” on iOS). Based in Bengaluru, Kamal draws on over a decade of experience in iOS across domains like healthcare, defense, fintech, and e-commerce.\n\nHis dual ventures reflect a passion for blending elegant technology with deep user engagement.",
            "startTime": 1758863100,
            "durationMinutes": 35,
            "type": "talk",
            "speakerId": "kamal-kumar"
        },
        {
            "id": "day-1-break",
            "title": "Break 🥤🕒",
            "description": null,
            "startTime": 1758865200,
            "durationMinutes": 25,
            "type": "others",
            "subtype": "Break",
            "speakerId": null
        },
        {
            "id": "arima-jain",
            "title": "From doodles to developer",
            "description": "Arima Jain is a young and dynamic iOS developer, indie maker, and speaker who combines her passion for design and coding to build educational and creative apps.\n\nAt just 20 years old, she is the founder and CEO of Lil Artist, and has also worked on FunKey, guiding her journey with accolades like being a WWDC ’22 Scholar and an Apple Entrepreneur Camp alumna.\n\nShe brings energy, innovation, and a fresh perspective to the Swift Swift Bharat stage.",
            "startTime": 1758866700,
            "durationMinutes": 30,
            "type": "talk",
            "speakerId": "arima-jain"
        },
        {
            "id": "logitch-lightning-panel",
            "title": "Redefining Developer Experience: MX in the Apple Ecosystem - Chiraayu & Hariom ⚡",
            "description": "Chiraayu Pandya is a senior technology leader at Logitech, bringing over 25 years of experience leading engineering and product teams across global brands.\n\nHe’s known for driving innovation in hardware, software, and connectivity, and for guiding Logitech’s efforts in blending user experience with technical excellence.\n\n\nHariom Palkar works at Swiggy as a product & engineering leader, previously co-founding ventures like RAW and Popcorn.\n\nHe’s deeply involved in building AI-driven products and scaling engineering systems, while bridging the gap between technology and real-world use cases.",
            "startTime": 1758868500,
            "durationMinutes": 35,
            "type": "panel",
            "speakerIds": ["chiraayu", "hariom"]
        },
        {
            "id": "day-1-group-photo",
            "title": "Group Photo Session 👥📸",
            "description": null,
            "startTime": 1758870600,
            "durationMinutes": 10,
            "type": "others",
            "subtype": "Photo",
            "speakerId": null
        },
        {
            "id": "day-1-lunch",
            "title": "Lunch 🍽️ 🍱 🥢",
            "description": null,
            "startTime": 1758871800,
            "durationMinutes": 90,
            "type": "others",
            "subtype": "Lunch",
            "speakerId": null
        },
        {
            "id": "danijela-vrzan",
            "title": "10 Skills to Level Up Your Career",
            "description": "Danijela Vrzan is a passionate iOS developer, writer, mentor, and keynote speaker who blends technical expertise with real-world insight.\n\nOriginally a civil engineer, she made a bold pivot into software, teaching herself to code and later earning a computer science degree.\n\nNow based in Toronto, Canada, she works across Swift, SwiftUI, localization, app architecture, and developer tools.\n\nOutside coding, she enjoys hiking, running, playing video games, and exploring new restaurants.",
            "startTime": 1758877200,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "danijela-vrzan"
        },
        {
            "id": "charlie-chapman",
            "title": "App Marketing(from an engineers perspective)",
            "description": "Charlie Chapman is an app developer, designer, podcaster, and Developer Advocate at RevenueCat.\n\nHe’s best known for creating the iOS app Dark Noise and hosting the interview podcast Launched.\n\nWith a passion for blending clean design, audio, and developer advocacy, Charlie brings a unique voice to the Swift Bharat stage.",
            "startTime": 1758879600,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "charlie-chapman"
        },
        {
            "id": "day-1-break-two",
            "title": "Break",
            "description": null,
            "startTime": 1758882000,
            "durationMinutes": 15,
            "type": "others",
            "subtype": "Break",
            "speakerId": null
        },
        {
            "id": "day-1-industry-panel",
            "title": "Surprise Speakers ✨🎤",
            "description": "Surprise Speakers add an element of excitement and curiosity to Swift Bharat.\n\nCarefully chosen from among some of the most inspiring voices in the iOS and tech community, they’ll take the stage unannounced to share fresh ideas, unique stories, and unexpected insights.\n\nGet ready for moments that surprise, delight, and stay with you long after the event.",
            "startTime": 1758882900,
            "durationMinutes": 70,
            "type": "panel",
            "speakerId": null
        }
    ],
    "dayTwo": [
        {
            "id": "day-2-registrations",
            "title": "Registrations & Light Snacks 🥤🕒",
            "description": null,
            "startTime": 1758943800,
            "durationMinutes": 40,
            "type": "others",
            "subtype": "Break",
            "speakerId": null
        },
        {
            "id": "curt-clifton",
            "title": "Create a custom control with SwiftUI",
            "description": "Curt Clifton is an App Technologies Evangelist at Apple, specializing in SwiftUI and helping bridge the gap between framework engineers and the developer community.\n\nBefore this, he spent years as a SwiftUI frameworks engineer, and earlier still worked on macOS/iOS software at Omni Group.\n\nHis academic roots run deep, he once served as a tenured professor and earned a PhD in Computer Science.\n\nToday he combines that depth of knowledge with a passion for teaching, speaking, and enabling developers to build better apps.",
            "startTime": 1758946500,
            "durationMinutes": 45,
            "type": "talk",
            "speakerId": "curt-clifton"
        },
        {
            "id": "krzysztof-zablocki",
            "title": "What people get wrong about testing?",
            "description": "Krzysztof Zabłocki is a renowned Swift engineer, creator, and open-source innovator whose work powers tens of thousands of apps.\n\nHe’s best known for founding Sourcery, a metaprogramming tool that reduces boilerplate in Swift, and for his focus on architecture, efficiency, and developer experience.\n\nOver his career, he’s led iOS teams at The New York Times, built indie apps, and recently turned his efforts toward consulting and teaching through his course SwiftyStack.",
            "startTime": 1758949200,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "krzysztof-zablocki"
        },
        {
            "id": "day-2-break",
            "title": "Break 🥤🕒",
            "description": null,
            "startTime": 1758951600,
            "durationMinutes": 25,
            "type": "others",
            "subtype": "Break",
            "speakerId": null
        },
        {
            "id": "garima-bothra",
            "title": "Does SwiftUI work in production?",
            "description": "Garima Bothra is a rising iOS engineer currently at Swiggy (SDE-2 iOS) and one of India’s 2021 Swift Student Challenge winners.\n\nShe’s passionate about SwiftUI, custom UI work, and sharing what she learns—with writing and teaching being part of her craft.\n\nHer journey is marked by a drive to turn complex ideas into delightful, practical apps, and she brings fresh energy and insight to the Swift Bharat stage.",
            "startTime": 1758953100,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "garima-bothra"
        },
        {
            "id": "josh-holtz",
            "title": "A Swift Drive into DSLs",
            "description": "Josh Holtz is a prolific software engineer, open-source advocate, and community builder.\n\nHe is the lead maintainer of fastlane, the automation toolchain used by hundreds of mobile development teams, and works as a software engineer at RevenueCat.\n\nHe’s also the founder of the Deep Dish Swift conference, and curates the newsletter Indie Dev Monday, while building projects like ConnectKit and An Otter RSS",
            "startTime": 1758955500,
            "durationMinutes": 40,
            "type": "talk",
            "speakerId": "josh-holtz"
        },
        {
            "id": "day-2-lunch",
            "title": "Lunch 🍽️🥗",
            "description": null,
            "startTime": 1758958200,
            "durationMinutes": 90,
            "type": "others",
            "subtype": "Lunch",
            "speakerId": null
        },
        {
            "id": "harshil-talk",
            "title": "Shipping Solo",
            "description": "Harshil Shah is an independent iOS engineer based in Mumbai, India.\n\nHe builds apps like Peak, a fitness dashboard for iPhone, iPad, and Apple Watch, and Pause, a Mac app to remind you to rest.\n\nPreviously, he’s worked at Riff and Stopwatch, and continues to explore elegant app design, health/fitness tech, and Swift-centric development.",
            "startTime": 1758963600,
            "durationMinutes": 40,
            "type": "others",
            "subtype": "Talk",
            "speakerId": "harshil"
        },
        {
            "id": "day-2-podcase",
            "title": "Launched Podcast - Raja V & Sandeep Ranade",
            "description": "Raja V (Raja Vijayaraman) is the indie creator behind Lumy, a beautifully designed app that helps users track sunlight, golden hour, moon phases, and plan outdoor routines.\n\nHis journey into app development sprung from a love of photography and light, and over time Lumy has grown into a globally loved tool, earning recognition such as “Apple Watch App of the Year 2024.\n\n\nSandeep Ranade is a musician-software engineer hybrid whose passion for Indian classical music meets technology.\n\nHe’s the creator of NaadSadhana, an AI-powered app for practicing and creating music, which won an Apple Design Award in 2021.\n\nTrained in both computer science and Hindustani classical vocal traditions, he builds tools that bring accessibility, rigor, and beauty to musical practice.”",
            "startTime": 1758966000,
            "durationMinutes": 75,
            "type": "panel",
            "speakerIds": ["raja-v", "sandeep-ranade"]
        },
        {
            "id": "day-2-break-two",
            "title": "Break",
            "description": null,
            "startTime": 1758970500,
            "durationMinutes": 25,
            "type": "others",
            "subtype": "Break",
            "speakerId": null
        },
        {
            "id": "peter-steinberger",
            "title": "Closing Keynote",
            "description": "Peter Steinberger (aka “steipete”) is a veteran iOS architect turned serial builder and open-source evangelist.\n\nHe founded PSPDFKit, a powerful PDF framework used across platforms, bootstrapped its growth, and eventually exited the company.\n\nNow based between Vienna and London, he experiments at the intersection of Swift, AI, and web tech, building tools like Peekaboo and Poltergeist.\n\nHe also spends time speaking around the world about code, resilience, and developer craftsmanship",
            "startTime": 1758972000,
            "durationMinutes": 45,
            "type": "talk",
            "speakerId": "peter-steinberger"
        },
        {
            "id": "day-2-closing",
            "title": "Closing Remarks - Organisers",
            "description": "",
            "startTime": 1758974700,
            "durationMinutes": 15,
            "type": "others",
            "subtype": "Closing",
            "speakerId": null
        }
    ]
}
